witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_processor.c
#include "audio_processor.h"
#include "stm32h7xx_hal.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>
#include "arm_math.h"
#include "fpga.h"
#include "trx_manager.h"
#include "wm8731.h"
#include "functions.h"
#include "audio_filters.h"
#include "agc.h"
#include "settings.h"
#include "profiler.h"
#include "usbd_audio_if.h"
#include "noise_reduction.h"
#include "cw_decoder.h"
#include "main.h"

volatile uint32_t AUDIOPROC_samples = 0;
volatile uint32_t AUDIOPROC_TXA_samples = 0;
volatile uint32_t AUDIOPROC_TXB_samples = 0;
SRAM1 int32_t Processor_AudioBuffer_A[FPGA_AUDIO_BUFFER_SIZE] = {0};
SRAM1 int32_t Processor_AudioBuffer_B[FPGA_AUDIO_BUFFER_SIZE] = {0};
volatile uint_fast8_t Processor_AudioBuffer_ReadyBuffer = 0;
volatile bool Processor_NeedRXBuffer = false;
volatile bool Processor_NeedTXBuffer = false;
SRAM1 float32_t FPGA_Audio_Buffer_RX1_Q_tmp[FPGA_AUDIO_BUFFER_HALF_SIZE] = {0};
SRAM1 float32_t FPGA_Audio_Buffer_RX1_I_tmp[FPGA_AUDIO_BUFFER_HALF_SIZE] = {0};
SRAM1 float32_t FPGA_Audio_Buffer_RX2_Q_tmp[FPGA_AUDIO_BUFFER_HALF_SIZE] = {0};
SRAM1 float32_t FPGA_Audio_Buffer_RX2_I_tmp[FPGA_AUDIO_BUFFER_HALF_SIZE] = {0};
SRAM1 float32_t FPGA_Audio_Buffer_TX_Q_tmp[FPGA_AUDIO_BUFFER_HALF_SIZE] = {0};
SRAM1 float32_t FPGA_Audio_Buffer_TX_I_tmp[FPGA_AUDIO_BUFFER_HALF_SIZE] = {0};
volatile float32_t Processor_AVG_amplitude = 0.0f;		  //средняя амплитуда семплов при прёме
volatile float32_t Processor_TX_MAX_amplitude_IN = 0.0f;  //средняя амплитуда семплов при передаче (до процессора)
volatile float32_t Processor_TX_MAX_amplitude_OUT = 0.0f; //средняя амплитуда семплов при передаче (после процессора)
volatile float32_t Processor_RX_Power_value = 0.0f;		  //максимальное значение силы сигнала
volatile float32_t ALC_need_gain = 1.0f;
volatile float32_t Processor_selected_RFpower_amplitude = 0.0f;

static float32_t ampl_val_i = 0.0f;
static float32_t ampl_val_q = 0.0f;
static float32_t ALC_need_gain_target = 1.0f;
static uint_fast16_t block = 0;
static uint32_t two_signal_gen_position = 0;

static void doRX_HILBERT(AUDIO_PROC_RX_NUM rx_id);
static void doRX_LPF(AUDIO_PROC_RX_NUM rx_id);
static void doRX_HPF(AUDIO_PROC_RX_NUM rx_id);
static void doRX_DNR(AUDIO_PROC_RX_NUM rx_id);
static void doRX_AGC(AUDIO_PROC_RX_NUM rx_id);
static void doRX_NOTCH(AUDIO_PROC_RX_NUM rx_id);
static void doRX_SMETER(AUDIO_PROC_RX_NUM rx_id);
static void doRX_COPYCHANNEL(AUDIO_PROC_RX_NUM rx_id);
static void doCW_Decode(AUDIO_PROC_RX_NUM rx_id);
static void DemodulateFM(AUDIO_PROC_RX_NUM rx_id);
static void ModulateFM(void);

void initAudioProcessor(void)
{
	InitAudioFilters();
	InitAGC();
	sendToDebug_strln("[OK] Audioprocessor inited");
}

void processRxAudio(void)
{
	if (!Processor_NeedRXBuffer)
		return;
	if (WM8731_Buffer_underrun)
	{
		Processor_NeedRXBuffer = false;
		return;
	}
	VFO *current_vfo = CurrentVFO();
	VFO *secondary_vfo = SecondaryVFO();

	AUDIOPROC_samples++;
	uint_fast16_t FPGA_Audio_Buffer_Index_tmp = FPGA_Audio_Buffer_Index;
	if (FPGA_Audio_Buffer_Index_tmp == 0)
		FPGA_Audio_Buffer_Index_tmp = FPGA_AUDIO_BUFFER_SIZE;
	else
		FPGA_Audio_Buffer_Index_tmp--;

	readHalfFromCircleBuffer32((uint32_t *)&FPGA_Audio_Buffer_RX1_Q[0], (uint32_t *)&FPGA_Audio_Buffer_RX1_Q_tmp[0], FPGA_Audio_Buffer_Index_tmp, FPGA_AUDIO_BUFFER_SIZE);
	readHalfFromCircleBuffer32((uint32_t *)&FPGA_Audio_Buffer_RX1_I[0], (uint32_t *)&FPGA_Audio_Buffer_RX1_I_tmp[0], FPGA_Audio_Buffer_Index_tmp, FPGA_AUDIO_BUFFER_SIZE);

	if(TRX.Dual_RX_Type != VFO_SEPARATE)
	{
		readHalfFromCircleBuffer32((uint32_t *)&FPGA_Audio_Buffer_RX2_Q[0], (uint32_t *)&FPGA_Audio_Buffer_RX2_Q_tmp[0], FPGA_Audio_Buffer_Index_tmp, FPGA_AUDIO_BUFFER_SIZE);
		readHalfFromCircleBuffer32((uint32_t *)&FPGA_Audio_Buffer_RX2_I[0], (uint32_t *)&FPGA_Audio_Buffer_RX2_I_tmp[0], FPGA_Audio_Buffer_Index_tmp, FPGA_AUDIO_BUFFER_SIZE);
	}
	
	//Process DC corrector filter
	if(current_vfo->Mode != TRX_MODE_AM && current_vfo->Mode != TRX_MODE_NFM && current_vfo->Mode != TRX_MODE_WFM)
	{
		dc_filter(FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, DC_FILTER_RX1_I);
		dc_filter(FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, DC_FILTER_RX1_Q);
	}
	if(TRX.Dual_RX_Type != VFO_SEPARATE && secondary_vfo->Mode != TRX_MODE_AM && secondary_vfo->Mode != TRX_MODE_NFM && secondary_vfo->Mode != TRX_MODE_WFM)
	{
		dc_filter(FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, DC_FILTER_RX2_I);
		dc_filter(FPGA_Audio_Buffer_RX2_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, DC_FILTER_RX2_Q);
	}

	//Применяем усиление ПЧ IF Gain
	if(current_vfo->Mode != TRX_MODE_IQ)
	{
		arm_scale_f32(FPGA_Audio_Buffer_RX1_I_tmp, db2rateV(TRX.IF_Gain), FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		arm_scale_f32(FPGA_Audio_Buffer_RX1_Q_tmp, db2rateV(TRX.IF_Gain), FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		if(TRX.Dual_RX_Type != VFO_SEPARATE)
		{
			arm_scale_f32(FPGA_Audio_Buffer_RX2_I_tmp, db2rateV(TRX.IF_Gain), FPGA_Audio_Buffer_RX2_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
			arm_scale_f32(FPGA_Audio_Buffer_RX2_Q_tmp, db2rateV(TRX.IF_Gain), FPGA_Audio_Buffer_RX2_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		}
	}

	switch (current_vfo->Mode) //первый приёмник
	{
	case TRX_MODE_LSB:
	case TRX_MODE_CW_L:
		doRX_HPF(AUDIO_RX1);
	case TRX_MODE_DIGI_L:
		doRX_HILBERT(AUDIO_RX1);
		doRX_LPF(AUDIO_RX1);
		arm_sub_f32(FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE); // difference of I and Q - LSB
		doRX_NOTCH(AUDIO_RX1);
		doRX_SMETER(AUDIO_RX1);
		doRX_DNR(AUDIO_RX1);
		doRX_AGC(AUDIO_RX1);
		doCW_Decode(AUDIO_RX1);
		doRX_COPYCHANNEL(AUDIO_RX1);
		break;
	case TRX_MODE_USB:
	case TRX_MODE_CW_U:
		doRX_HPF(AUDIO_RX1);
	case TRX_MODE_DIGI_U:
		doRX_HILBERT(AUDIO_RX1);
		doRX_LPF(AUDIO_RX1);
		arm_add_f32(FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE); // sum of I and Q - USB
		doRX_NOTCH(AUDIO_RX1);
		doRX_SMETER(AUDIO_RX1);
		doRX_DNR(AUDIO_RX1);
		doRX_AGC(AUDIO_RX1);
		doCW_Decode(AUDIO_RX1);
		doRX_COPYCHANNEL(AUDIO_RX1);
		break;
	case TRX_MODE_AM:
		doRX_LPF(AUDIO_RX1);
		arm_mult_f32(FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		arm_mult_f32(FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		arm_add_f32(FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_Q_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		//arm_vsqrt_f32(FPGA_Audio_Buffer_RX1_I_tmp, FPGA_Audio_Buffer_RX1_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		for (uint_fast16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
			arm_sqrt_f32(FPGA_Audio_Buffer_RX1_I_tmp[i], &FPGA_Audio_Buffer_RX1_I_tmp[i]);
		doRX_NOTCH(AUDIO_RX1);
		doRX_SMETER(AUDIO_RX1);
		doRX_DNR(AUDIO_RX1);
		doRX_AGC(AUDIO_RX1);
		doRX_COPYCHANNEL(AUDIO_RX1);
		break;
	case TRX_MODE_NFM:
	case TRX_MODE_WFM:
		doRX_LPF(AUDIO_RX1);
		DemodulateFM(AUDIO_RX1);
		doRX_SMETER(AUDIO_RX1);
		doRX_DNR(AUDIO_RX1);
		doRX_AGC(AUDIO_RX1);
		doRX_COPYCHANNEL(AUDIO_RX1);
		break;
	case TRX_MODE_IQ:
	default:
		doRX_SMETER(AUDIO_RX1);
		break;
	}
	
